---
kind: type
id: T:Autodesk.Revit.DB.Electrical.WireMaterialTypeSet
source: html/b682dc26-30ab-9a2c-a195-dba38099d7da.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialTypeSet

A set that contains wire material types.

## Syntax (C#)
```csharp
public class WireMaterialTypeSet : APIObject,
	IEnumerable
```